#ಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ#ಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ#ಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ#ಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ

def square_array(array=[1,2,3])
  some_array = []
  counter = 0


  while array[counter] do
    some_array << array[counter] * array[counter]
    counter += 1
  end

  return some_array
end

square_array


#ಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ
#ಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ#ಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ#ಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ#ಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ_ಠಠ
